app/Http/Controllers/Grupos_permisosController.php

select * from `grupos_permisos` order by `id` desc limit 2 offset 0
select count(*) as aggregate from `grupos_permisos`
---
    public function index(Request $request)
    {
        $npag=2;
        $buscar=$request->query('buscar','');
        $criterio=$request->query('criterio','');

        if ($buscar==''){
            $datos = Grupos_permisos::orderBy('id','desc')->paginate($npag);